content/posts/Joachim_Krug_ICTS_Lectures_June_2019.md
+++
title = "Joachim Krug ICTS Lectures June 2019"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:52-04:00
slug = "Joachim_Krug_ICTS_Lectures_June_2019"
draft = false
+++

## [Joachim Krug]({{< relref "Joachim_Krug" >}}) {#joachim-krug--joachim-krug-dot-md}


## [Playlist](<https://www.youtube.com/playlist?list=PLNFIflbQ6VNufDz-eQmHy5-G3EzCfS6NR>) from ICTS June 2019 {#playlist--https-www-dot-youtube-dot-com-playlist-list-plnfiflbq6vnufdz-eqmhy5-g3ezcfs6nr--from-icts-june-2019}


## Screenshots from lectures on [google photos](<https://photos.google.com/album/AF1QipOXo1A7RyYeDP%5F54w%5FiwRUceFeBBc9Q1fWMptbv>) {#screenshots-from-lectures-on-google-photos--https-photos-dot-google-dot-com-album-af1qipoxo1a7ryyedp-54w-iwrucefebbc9q1fwmptbv}


## ****Course 1 :\*\* Statistical physics of biological evolution by \*\*Joachim Krug (Cologne, Germany)**** {#course-1-statistical-physics-of-biological-evolution-by-joachim-krug--cologne-germany}


### Lecture 1 : Stochastic models of population dynamics: Wright-Fisher and Moran models; fixation; diffusion theory. {#lecture-1-stochastic-models-of-population-dynamics-wright-fisher-and-moran-models-fixation-diffusion-theory-dot}

<!--list-separator-->

-  <https://en.wikipedia.org/wiki/Patrick%5FMatthew> developed a theory of evolution that did not become known

<!--list-separator-->

-  Lenski 12 populations of <span class="underline"><span class="underline">E. coli</span></span> evolved under constant nutrient-poor conditions since 1988

    <!--list-separator-->

    -  Some populations turned into hypermutators with higher relative fitness

<!--list-separator-->

-  Compare fitness by combining strain 1 and strain 2 in 50% proportions and observe the population dynamics that arise in a given environment. The slope of the ratio of population sizes is a reasonable proxy for <span class="underline"><span class="underline">fitness</span></span>.

<!--list-separator-->

-

<!--list-separator-->

-  \\[\mathbb{E}(H'|n) = H(l-\frac{l}{m}) \lt H\\]

<!--list-separator-->

-


### Lecture 2 : Fitness landscapes I: Epistasis and sign epistasis; sequence spaces; measures of fitness landscape ruggedness. {#lecture-2-fitness-landscapes-i-epistasis-and-sign-epistasis-sequence-spaces-measures-of-fitness-landscape-ruggedness-dot}


### Lecture 3 : Fitness landscapes II: Random field models; accessibility percolation {#lecture-3-fitness-landscapes-ii-random-field-models-accessibility-percolation}


### Lecture 4 : Dynamics on fitness landscapes I: Origin-fixation models; mutational landscape model and adaptive walks. {#lecture-4-dynamics-on-fitness-landscapes-i-origin-fixation-models-mutational-landscape-model-and-adaptive-walks-dot}


### Lecture 5 : Dynamics on fitness landscapes II: Rank order processes; extreme value theory in evolutionary biology. {#lecture-5-dynamics-on-fitness-landscapes-ii-rank-order-processes-extreme-value-theory-in-evolutionary-biology-dot}
